In [0]:
import pandas as pd
import numpy as np
from google.colab import files

In [0]:
up=files.upload()

In [0]:
df=pd.read_excel('attendance.xls',header=1,na_values=['‡','(†)'])

In [20]:
df.head()

                  Unnamed: 0  ...  Unnamed: 16
0                          1  ...          NaN
1     United States ........  ...     0.040308
2  Alabama .................  ...     0.173120
3  Alaska ..................  ...     0.145993
4  Arizona .................  ...     0.248824

[5 rows x 17 columns]

In [21]:
sorted(df)

['ADA as percent of enrollment',
 'ADA as percent of enrollment.1',
 'ADA as percent of enrollment.2',
 'Average days in school year',
 'Average hours in school day',
 'Average hours in school day.1',
 'Average hours in school day.2',
 'Average hours in school year',
 'Unnamed: 0',
 'Unnamed: 10',
 'Unnamed: 12',
 'Unnamed: 14',
 'Unnamed: 16',
 'Unnamed: 2',
 'Unnamed: 4',
 'Unnamed: 6',
 'Unnamed: 8']

In [12]:
df.isnull().sum()

Unnamed: 0                         9
ADA as percent of enrollment       9
Unnamed: 2                        10
Average hours in school day        9
Unnamed: 4                        10
Average days in school year        9
Unnamed: 6                        10
Average hours in school year       9
Unnamed: 8                        10
ADA as percent of enrollment.1     9
Unnamed: 10                       10
Average hours in school day.1      9
Unnamed: 12                       10
ADA as percent of enrollment.2    14
Unnamed: 14                       15
Average hours in school day.2     13
Unnamed: 16                       14
dtype: int64

In [13]:
df.shape

(62, 17)

In [0]:
df.drop(['Unnamed: 10',
 'Unnamed: 12',
 'Unnamed: 14',
 'Unnamed: 16',
 'Unnamed: 2',
 'Unnamed: 4',
 'Unnamed: 6',
 'Unnamed: 8'],inplace=True,axis=1)

In [23]:
df.head()

                  Unnamed: 0  ...  Average hours in school day.2
0                          1  ...                       9.000000
1     United States ........  ...                       6.594394
2  Alabama .................  ...                       7.137239
3  Alaska ..................  ...                       6.240865
4  Arizona .................  ...                       6.369092

[5 rows x 9 columns]

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 48 entries, 0 to 61
Data columns (total 9 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Unnamed: 0                      48 non-null     object
 1   ADA as percent of enrollment    48 non-null     float64
 2   Average hours in school day     48 non-null     float64
 3   Average days in school year     48 non-null     float64
 4   Average hours in school year    48 non-null     float64
 5   ADA as percent of enrollment.1  48 non-null     float64
 6   Average hours in school day.1   48 non-null     float64
 7   ADA as percent of enrollment.2  48 non-null     float64
 8   Average hours in school day.2   48 non-null     float64
dtypes: float64(8), object(1)
memory usage: 3.8+ KB

In [0]:
df.dropna(inplace=True)

In [0]:
df.drop(labels=0,axis=0,inplace=True)

In [0]:
df.rename(columns={'Unnamed: 0':'state'},inplace=True)

In [33]:
df.head()

                       state  ...  Average hours in school day.2
1     United States ........  ...                       6.594394
2  Alabama .................  ...                       7.137239
3  Alaska ..................  ...                       6.240865
4  Arizona .................  ...                       6.369092
5  Arkansas ................  ...                       6.767508

[5 rows x 9 columns]

In [0]:
df['state']=df['state'].str.replace('.','')

In [40]:
df.head()

               state  ...  Average hours in school day.2
1     United States   ...                       6.594394
2           Alabama   ...                       7.137239
3            Alaska   ...                       6.240865
4           Arizona   ...                       6.369092
5          Arkansas   ...                       6.767508

[5 rows x 9 columns]